In [1]:
import pandas as pd

#### Ans : 1

In [4]:
S1 = pd.Series([4,8,15,16,23,42])
type(S1)

pandas.core.series.Series

In [5]:
S1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Ans : 2

In [10]:
L = [i for i in range(1,11)]
S2 = pd.Series(L)
S2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

#### Ans : 3

In [13]:
persons =[
    {"Name": "Alice", "Age" : 25, "Gender" : "Female"},
    {"Name": "Bob", "Age" : 30, "Gender" : "Male"},
    {"Name": "Claire", "Age" : 27,"Gender" : "Female"}
]
df = pd.DataFrame(persons)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Ans : 4

#### DataFrame : 
It is a tabular structure which is collection of one or more series. Example : df(Ans 3) is a dataframe.

#### Ans : 5

In [19]:
print("Shape : ", df.shape)
print("Type : ", type(df))

Shape :  (3, 3)
Type :  <class 'pandas.core.frame.DataFrame'>

In [21]:
print("Get Single columns: ")
df['Name']

Get Single columns:

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [22]:
df[['Name', 'Age']]

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

#### Ans : 6
DataFrame

#### Ans : 7

In [17]:
df2 = pd.DataFrame({
    "Names" : pd.Series(['Sandeep', 'Sanjay', 'Mandeep']),
    "Roll Number" : pd.Series([101,102,103])
})
df2

     Names  Roll Number
0  Sandeep          101
1   Sanjay          102
2  Mandeep          103